# Pandas
- library for Data Analysis and Manipulation


## Why Pandas?
- provides ability to work with Tabular data.
- **Tabular Data** - data that is organized into tables having rows and cols

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\clash\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\clash\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\clash\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\clash\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\clash\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\clash\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd

## Series
- Series is a one dimensional labelled array that can hold/store data

In [3]:
book_title = ['C++', 'Java', 'Python', 'JavaScript']  
# Created a list

In [4]:
# Convert that created list into Series
book_title = pd.Series(book_title)
book_title

# Indexes are by default numeric.

0           C++
1          Java
2        Python
3    JavaScript
dtype: object

In [5]:
book_title[2]

'Python'

In [6]:
# To give indexes of our choice
book_title.index = ['a', 'b', 'c', 'd']

In [7]:
book_title

a           C++
b          Java
c        Python
d    JavaScript
dtype: object

In [8]:
book_title['c']

'Python'

## DataFrame - Introduction
- 2D labelled array having index and columns. 
- multiple series combined together to form a Dataframe.
- most widely used data structure in pandas

In [9]:
import numpy as np

In [10]:
arr = np.random.randint(10, 100, size =(6, 4))
arr

# Used to create a random array of numbers between 10 and 100 and size of array will be (6,4)

array([[70, 31, 33, 74],
       [57, 51, 25, 60],
       [53, 41, 76, 69],
       [16, 19, 84, 85],
       [44, 71, 57, 51],
       [13, 91, 59, 40]])

In [11]:
df = pd.DataFrame(data=arr)
df

#df is a varible. This is how we created a DataFrame of that array.

    0   1   2   3
0  70  31  33  74
1  57  51  25  60
2  53  41  76  69
3  16  19  84  85
4  44  71  57  51
5  13  91  59  40

In [12]:
df[2] 

#To extract 2nd column of DataFrame

0    33
1    25
2    76
3    84
4    57
5    59
Name: 2, dtype: int32

In [13]:
type(df[2])

pandas.core.series.Series

In [14]:
df.columns =  ['A', 'B','C','D']
df

# To give custom columns to Data Frame

    A   B   C   D
0  70  31  33  74
1  57  51  25  60
2  53  41  76  69
3  16  19  84  85
4  44  71  57  51
5  13  91  59  40

In [15]:
df['D']

# Ye string mein hi likhna pdega D coz D is not a varible here.

0    74
1    60
2    69
3    85
4    51
5    40
Name: D, dtype: int32

In [16]:
df.shape

# Gives the shape of DataFrame

(6, 4)

In [17]:
df.head(n=3)

# Head is used to return top values

    A   B   C   D
0  70  31  33  74
1  57  51  25  60
2  53  41  76  69

In [18]:
df.tail(n=2)

# Tail is used to get bottom rows.

    A   B   C   D
4  44  71  57  51
5  13  91  59  40

In [19]:
cols = ['A', 'B']
df[cols]

# To get multiple columns together

    A   B
0  70  31
1  57  51
2  53  41
3  16  19
4  44  71
5  13  91

In [20]:
df[['A', 'B']]

# Another way to get multiple columns together

    A   B
0  70  31
1  57  51
2  53  41
3  16  19
4  44  71
5  13  91

In [21]:
df[['B', 'D', 'A']]

# Yahi order mein milega output

    B   D   A
0  31  74  70
1  51  60  57
2  41  69  53
3  19  85  16
4  71  51  44
5  91  40  13

In [22]:
df

    A   B   C   D
0  70  31  33  74
1  57  51  25  60
2  53  41  76  69
3  16  19  84  85
4  44  71  57  51
5  13  91  59  40

# Add New Columns

In [23]:
df['A+B'] = df['A'] + df['B']

# To add a new column that will contains values of (Col A + Col B)

In [24]:
df

    A   B   C   D  A+B
0  70  31  33  74  101
1  57  51  25  60  108
2  53  41  76  69   94
3  16  19  84  85   35
4  44  71  57  51  115
5  13  91  59  40  104

In [25]:
df['A-B'] = df['A'] - df['B']

In [26]:
df

    A   B   C   D  A+B  A-B
0  70  31  33  74  101   39
1  57  51  25  60  108    6
2  53  41  76  69   94   12
3  16  19  84  85   35   -3
4  44  71  57  51  115  -27
5  13  91  59  40  104  -78

In [27]:
df.drop(columns=['A-B'], inplace=True)

# To drop a column and inplace = true krne k baad orginial DataFrame mein changes ho jaayege.

In [28]:
df

    A   B   C   D  A+B
0  70  31  33  74  101
1  57  51  25  60  108
2  53  41  76  69   94
3  16  19  84  85   35
4  44  71  57  51  115
5  13  91  59  40  104

### Indexing/Extracting Data

In [29]:
df.index = "p q r s t u".split()

# To access data row-wise.
# Split DataFrame into this index format. Har ek Series ko inme se index milega.

In [30]:
df

    A   B   C   D  A+B
p  70  31  33  74  101
q  57  51  25  60  108
r  53  41  76  69   94
s  16  19  84  85   35
t  44  71  57  51  115
u  13  91  59  40  104

In [31]:
# loc - location. To access row-wise data
df.loc['p']

A       70
B       31
C       33
D       74
A+B    101
Name: p, dtype: int32

In [32]:
df.loc['t']

A       44
B       71
C       57
D       51
A+B    115
Name: t, dtype: int32

In [33]:
# iloc - integer location. Integers se hi access krna ho toh
df.iloc[4]

A       44
B       71
C       57
D       51
A+B    115
Name: t, dtype: int32

In [34]:
df.iloc[0]

A       70
B       31
C       33
D       74
A+B    101
Name: p, dtype: int32

In [35]:
df.iloc[2:5]

# To extract multiple rows. iloc is to extract rows not cols

    A   B   C   D  A+B
r  53  41  76  69   94
s  16  19  84  85   35
t  44  71  57  51  115

In [36]:
df.iloc[2:5][['A', 'B']] 

# iloc is to extract rows and saath mein 2 cols A and B

    A   B
r  53  41
s  16  19
t  44  71

In [37]:
df

    A   B   C   D  A+B
p  70  31  33  74  101
q  57  51  25  60  108
r  53  41  76  69   94
s  16  19  84  85   35
t  44  71  57  51  115
u  13  91  59  40  104

In [38]:
df.iloc[-2:][['D', 'A+B']]

    D  A+B
t  51  115
u  40  104

In [39]:
df.iloc[-2: , -2: ]

# rows mein -2 se last row tak and cols mein bhi -2 se last col tak.

    D  A+B
t  51  115
u  40  104

### Masking - Boolean Indexing

In [40]:
df

    A   B   C   D  A+B
p  70  31  33  74  101
q  57  51  25  60  108
r  53  41  76  69   94
s  16  19  84  85   35
t  44  71  57  51  115
u  13  91  59  40  104

In [41]:
# masking -> Return true for the elements that are more than mask.
mask = df > 30
mask

       A      B      C     D   A+B
p   True   True   True  True  True
q   True   True  False  True  True
r   True   True   True  True  True
s  False  False   True  True  True
t   True   True   True  True  True
u  False   True   True  True  True

In [42]:
df[mask]

# To get values jahan True aaya thaa Mask mein and jahan false thaa vahan NaN aajaayega.

      A     B     C   D  A+B
p  70.0  31.0  33.0  74  101
q  57.0  51.0   NaN  60  108
r  53.0  41.0  76.0  69   94
s   NaN   NaN  84.0  85   35
t  44.0  71.0  57.0  51  115
u   NaN  91.0  59.0  40  104

In [43]:
df[ df > 30 ]

# Jahan pe elements 30 se upar hai unko show krega. Baaki ki jagah NaN

      A     B     C   D  A+B
p  70.0  31.0  33.0  74  101
q  57.0  51.0   NaN  60  108
r  53.0  41.0  76.0  69   94
s   NaN   NaN  84.0  85   35
t  44.0  71.0  57.0  51  115
u   NaN  91.0  59.0  40  104

In [44]:
mask = df['B'] > 40
mask

# B col mein jahan greater than 40 hai vahan true aayega. Changes are saved now in Mask Variable.

p    False
q     True
r     True
s    False
t     True
u     True
Name: B, dtype: bool

In [45]:
df[mask]

    A   B   C   D  A+B
q  57  51  25  60  108
r  53  41  76  69   94
t  44  71  57  51  115
u  13  91  59  40  104

In [46]:
# extracting values from Col C and col D where B column has value>40
df[ df['B'] > 40 ] [['C', 'D']]

    C   D
q  25  60
r  76  69
t  57  51
u  59  40

In [47]:
df['A']>40

p     True
q     True
r     True
s    False
t     True
u    False
Name: A, dtype: bool

In [48]:
df

    A   B   C   D  A+B
p  70  31  33  74  101
q  57  51  25  60  108
r  53  41  76  69   94
s  16  19  84  85   35
t  44  71  57  51  115
u  13  91  59  40  104

In [49]:
(df['A']> 40) & (df['D']<50)

p    False
q    False
r    False
s    False
t    False
u    False
dtype: bool

In [50]:
df[ (df['A']> 40) & (df['D']<50) ]

# Bahar ek aur df lgadiya mtlb ab true ki values mil jaayegi

Empty DataFrame
Columns: [A, B, C, D, A+B]
Index: []

In [51]:
df

    A   B   C   D  A+B
p  70  31  33  74  101
q  57  51  25  60  108
r  53  41  76  69   94
s  16  19  84  85   35
t  44  71  57  51  115
u  13  91  59  40  104

In [52]:
df_array = df.values
df_array

# Df values ka array bana diya.

array([[ 70,  31,  33,  74, 101],
       [ 57,  51,  25,  60, 108],
       [ 53,  41,  76,  69,  94],
       [ 16,  19,  84,  85,  35],
       [ 44,  71,  57,  51, 115],
       [ 13,  91,  59,  40, 104]])

## Iris Dataset -  Introduction

In [53]:
iris = pd.read_csv("./iris.csv")

In [54]:
type(iris)

pandas.core.frame.DataFrame

In [55]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [56]:
iris.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [57]:
#  total of 150 data points(0 to 149), 
#  columns are 5
iris.shape

(150, 5)

In [58]:
iris.columns

# To get Names of Columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [59]:
iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [60]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [61]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [62]:
iris['species']

0         setosa
1         setosa
2         setosa
3         setosa
4         setosa
         ...
145    virginica
146    virginica
147    virginica
148    virginica
149    virginica
Name: species, Length: 150, dtype: object

In [63]:
iris['species'].nunique()

# To get number/count of unique values in species column

3

In [64]:
iris['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [65]:
iris['species'] == 'setosa'

# Creates a Mask

0       True
1       True
2       True
3       True
4       True
       ...
145    False
146    False
147    False
148    False
149    False
Name: species, Length: 150, dtype: bool

In [66]:
iris [ iris['species'] == 'setosa' ]

    sepal_length  sepal_width  petal_length  petal_width species
0            5.1          3.5           1.4          0.2  setosa
1            4.9          3.0           1.4          0.2  setosa
2            4.7          3.2           1.3          0.2  setosa
3            4.6          3.1           1.5          0.2  setosa
4            5.0          3.6           1.4          0.2  setosa
5            5.4          3.9           1.7          0.4  setosa
6            4.6          3.4           1.4          0.3  setosa
7            5.0          3.4           1.5          0.2  setosa
8            4.4          2.9           1.4          0.2  setosa
9            4.9          3.1           1.5          0.1  setosa
10           5.4          3.7           1.5          0.2  setosa
11           4.8          3.4           1.6          0.2  setosa
12           4.8          3.0           1.4          0.1  setosa
13           4.3          3.0           1.1          0.1  setosa
14           5.8          4.0           1.2          0.2  setosa
15           5.7          4.4           1.5          0.4  setosa
16           5.4          3.9           1.3          0.4  setosa
17           5.1          3.5           1.4          0.3  setosa
18           5.7          3.8           1.7          0.3  setosa
19           5.1          3.8           1.5          0.3  setosa
20           5.4          3.4           1.7          0.2  setosa
21           5.1          3.7           1.5          0.4  setosa
22           4.6          3.6           1.0          0.2  setosa
23           5.1          3.3           1.7          0.5  setosa
24           4.8          3.4           1.9          0.2  setosa
25           5.0          3.0           1.6          0.2  setosa
26           5.0          3.4           1.6          0.4  setosa
27           5.2          3.5           1.5          0.2  setosa
28           5.2          3.4           1.4          0.2  setosa
29           4.7          3.2           1.6          0.2  setosa
30           4.8          3.1           1.6          0.2  setosa
31           5.4          3.4           1.5          0.4  setosa
32           5.2          4.1           1.5          0.1  setosa
33           5.5          4.2           1.4          0.2  setosa
34           4.9          3.1           1.5          0.1  setosa
35           5.0          3.2           1.2          0.2  setosa
36           5.5          3.5           1.3          0.2  setosa
37           4.9          3.1           1.5          0.1  setosa
38           4.4          3.0           1.3          0.2  setosa
39           5.1          3.4           1.5          0.2  setosa
40           5.0          3.5           1.3          0.3  setosa
41           4.5          2.3           1.3          0.3  setosa
42           4.4          3.2           1.3          0.2  setosa
43           5.0          3.5           1.6          0.6  setosa
44           5.1          3.8           1.9          0.4  setosa
45           4.8          3.0           1.4          0.3  setosa
46           5.1          3.8           1.6          0.2  setosa
47           4.6          3.2           1.4          0.2  setosa
48           5.3          3.7           1.5          0.2  setosa
49           5.0          3.3           1.4          0.2  setosa

In [67]:
#  How many setosa flowers are there?
iris [ iris['species'] == 'setosa' ].shape

(50, 5)

In [68]:
iris['species'].value_counts()

species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

In [69]:
iris['species'].value_counts()['setosa']

50

In [70]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [71]:
iris['sepal_length'].mean()

5.843333333333334

In [72]:
iris['petal_width'].max()

2.5

In [73]:
iris['petal_width'].min()

0.1

In [74]:
iris['petal_width'].sum()

179.8

In [75]:
iris['petal_width']

0      0.2
1      0.2
2      0.2
3      0.2
4      0.2
      ...
145    2.3
146    1.9
147    2.0
148    2.3
149    1.8
Name: petal_width, Length: 150, dtype: float64

In [76]:
iris.sort_values(by=["sepal_length", "sepal_width"])

# If sepal_length same hai toh sepal_width k hisaab se sort hongi values.

     sepal_length  sepal_width  petal_length  petal_width    species
13            4.3          3.0           1.1          0.1     setosa
8             4.4          2.9           1.4          0.2     setosa
38            4.4          3.0           1.3          0.2     setosa
42            4.4          3.2           1.3          0.2     setosa
41            4.5          2.3           1.3          0.3     setosa
..            ...          ...           ...          ...        ...
118           7.7          2.6           6.9          2.3  virginica
122           7.7          2.8           6.7          2.0  virginica
135           7.7          3.0           6.1          2.3  virginica
117           7.7          3.8           6.7          2.2  virginica
131           7.9          3.8           6.4          2.0  virginica

[150 rows x 5 columns]

In [77]:
iris['species'].apply(len)

# Apply k ander jo bhi likhege vo sabhi values pe apply ho jaayega.
# Species ki length calculate kr rhe hai yahan.

0      6
1      6
2      6
3      6
4      6
      ..
145    9
146    9
147    9
148    9
149    9
Name: species, Length: 150, dtype: int64

In [78]:
len('setosa')

6

In [79]:
len('virginica')

9

In [80]:
iris.apply(lambda x: x + x)

     sepal_length  sepal_width  petal_length  petal_width             species
0            10.2          7.0           2.8          0.4        setosasetosa
1             9.8          6.0           2.8          0.4        setosasetosa
2             9.4          6.4           2.6          0.4        setosasetosa
3             9.2          6.2           3.0          0.4        setosasetosa
4            10.0          7.2           2.8          0.4        setosasetosa
..            ...          ...           ...          ...                 ...
145          13.4          6.0          10.4          4.6  virginicavirginica
146          12.6          5.0          10.0          3.8  virginicavirginica
147          13.0          6.0          10.4          4.0  virginicavirginica
148          12.4          6.8          10.8          4.6  virginicavirginica
149          11.8          6.0          10.2          3.6  virginicavirginica

[150 rows x 5 columns]

### Grouping Data Together

In [81]:
iris.aggregate('min')

# Gives Minimum of each column

sepal_length       4.3
sepal_width        2.0
petal_length       1.0
petal_width        0.1
species         setosa
dtype: object

In [82]:
groupby = iris.groupby('species')
groupby

# Species se data ko group by krdiya

In [83]:
groupby.min()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               4.3          2.3           1.0          0.1
versicolor           4.9          2.0           3.0          1.0
virginica            4.9          2.2           4.5          1.4

In [84]:
groupby.mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.418         1.464        0.244
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [85]:
iris[ iris['species'] == 'setosa' ]['sepal_length'].mean()

5.006

In [86]:
groupby.count()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa                50           50            50           50
versicolor            50           50            50           50
virginica             50           50            50           50

In [87]:
groupby.sum()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             250.3        170.9          73.2         12.2
versicolor         296.8        138.5         213.0         66.3
virginica          329.4        148.7         277.6        101.3

In [88]:
groupby.describe().T

# T is to do transpose, interchange rows and cols

species                setosa  versicolor  virginica
sepal_length count  50.000000   50.000000  50.000000
             mean    5.006000    5.936000   6.588000
             std     0.352490    0.516171   0.635880
             min     4.300000    4.900000   4.900000
             25%     4.800000    5.600000   6.225000
             50%     5.000000    5.900000   6.500000
             75%     5.200000    6.300000   6.900000
             max     5.800000    7.000000   7.900000
sepal_width  count  50.000000   50.000000  50.000000
             mean    3.418000    2.770000   2.974000
             std     0.381024    0.313798   0.322497
             min     2.300000    2.000000   2.200000
             25%     3.125000    2.525000   2.800000
             50%     3.400000    2.800000   3.000000
             75%     3.675000    3.000000   3.175000
             max     4.400000    3.400000   3.800000
petal_length count  50.000000   50.000000  50.000000
             mean    1.464000    4.260000   5.552000
             std     0.173511    0.469911   0.551895
             min     1.000000    3.000000   4.500000
             25%     1.400000    4.000000   5.100000
             50%     1.500000    4.350000   5.550000
             75%     1.575000    4.600000   5.875000
             max     1.900000    5.100000   6.900000
petal_width  count  50.000000   50.000000  50.000000
             mean    0.244000    1.326000   2.026000
             std     0.107210    0.197753   0.274650
             min     0.100000    1.000000   1.400000
             25%     0.200000    1.200000   1.800000
             50%     0.200000    1.300000   2.000000
             75%     0.300000    1.500000   2.300000
             max     0.600000    1.800000   2.500000

### Handling Missing Data
- dropna()
- fillna()

In [89]:
iris = pd.read_csv('./iris.csv')

In [90]:
import warnings
warnings.filterwarnings('ignore')

# It will ignore warnings

In [91]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [92]:
nan_idx = np.random.randint(0, 150, 20)
nan_idx

# 0 to 150 tak 20 random rows leli

array([ 23, 118,  83,  66,  30,  39, 104,  79, 135, 108,  42,  22, 124,
       126,  11,  64,  63, 111, 112, 108])

In [93]:
nan_idx = np.random.randint(0, 150, 20)
iris['sepal_length'][nan_idx]

# 0 to 150 tak 20 random rows ki sepal length and index dikhayega and inko NaN krenge next step mein

32     5.2
96     5.7
53     5.5
2      4.7
115    6.4
31     5.4
22     4.6
111    6.4
15     5.7
47     4.6
134    6.1
99     5.7
40     5.0
122    7.7
134    6.1
76     6.8
44     5.1
73     6.1
115    6.4
149    5.9
Name: sepal_length, dtype: float64

In [94]:
nan_idx = np.random.randint(0, 150, 20)
iris['sepal_length'][nan_idx] = np.nan

# 0 to 150 tak 20 random rows ki values ko NaN value krdega

In [95]:
iris['sepal_length']

0      NaN
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal_length, Length: 150, dtype: float64

In [96]:
iris['sepal_length'][ :50]

# First 50 rows ko show krega.

0     NaN
1     4.9
2     4.7
3     4.6
4     5.0
5     5.4
6     NaN
7     5.0
8     4.4
9     4.9
10    5.4
11    4.8
12    4.8
13    4.3
14    NaN
15    NaN
16    5.4
17    5.1
18    5.7
19    5.1
20    NaN
21    5.1
22    4.6
23    5.1
24    4.8
25    5.0
26    5.0
27    5.2
28    5.2
29    4.7
30    4.8
31    5.4
32    5.2
33    5.5
34    NaN
35    NaN
36    5.5
37    4.9
38    4.4
39    NaN
40    5.0
41    4.5
42    4.4
43    5.0
44    5.1
45    4.8
46    5.1
47    4.6
48    5.3
49    5.0
Name: sepal_length, dtype: float64

In [97]:
iris.isna().sum()

# Null Values ka count dega

sepal_length    19
sepal_width      0
petal_length     0
petal_width      0
species          0
dtype: int64

In [98]:
# iris.dropna()

# Jin rows mein NaN hai unn rows ko hi remove krdega.

In [99]:
iris['sepal_length'].fillna(value = "FILLTHIS")[:50]

# NaN ki jagah FILLTHIS likha aajaayega sabhi jagah

0     FILLTHIS
1          4.9
2          4.7
3          4.6
4          5.0
5          5.4
6     FILLTHIS
7          5.0
8          4.4
9          4.9
10         5.4
11         4.8
12         4.8
13         4.3
14    FILLTHIS
15    FILLTHIS
16         5.4
17         5.1
18         5.7
19         5.1
20    FILLTHIS
21         5.1
22         4.6
23         5.1
24         4.8
25         5.0
26         5.0
27         5.2
28         5.2
29         4.7
30         4.8
31         5.4
32         5.2
33         5.5
34    FILLTHIS
35    FILLTHIS
36         5.5
37         4.9
38         4.4
39    FILLTHIS
40         5.0
41         4.5
42         4.4
43         5.0
44         5.1
45         4.8
46         5.1
47         4.6
48         5.3
49         5.0
Name: sepal_length, dtype: object

In [100]:
iris['sepal_length'] =  iris['sepal_length'].fillna(value = round(iris['sepal_length'].mean(), 1) )

# NaN values ki jagah mean value daaldi roundup krke 1 decimal place tak.

In [101]:
iris['sepal_length'][:50]

0     5.8
1     4.9
2     4.7
3     4.6
4     5.0
5     5.4
6     5.8
7     5.0
8     4.4
9     4.9
10    5.4
11    4.8
12    4.8
13    4.3
14    5.8
15    5.8
16    5.4
17    5.1
18    5.7
19    5.1
20    5.8
21    5.1
22    4.6
23    5.1
24    4.8
25    5.0
26    5.0
27    5.2
28    5.2
29    4.7
30    4.8
31    5.4
32    5.2
33    5.5
34    5.8
35    5.8
36    5.5
37    4.9
38    4.4
39    5.8
40    5.0
41    4.5
42    4.4
43    5.0
44    5.1
45    4.8
46    5.1
47    4.6
48    5.3
49    5.0
Name: sepal_length, dtype: float64

In [102]:
iris.isna().sum()

# NaN values ka sum krke dega ye but ab ek bhi NaN values nhi hai apne paas

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

### Concate Dataframes

In [103]:
new_df = pd.DataFrame( np.random.randint(0, 7, size=(10, 4)))

# created a new DataFrame

In [104]:
new_df

   0  1  2  3
0  1  6  1  2
1  2  1  2  5
2  4  3  1  0
3  2  0  2  5
4  5  0  6  5
5  4  4  0  1
6  6  2  3  0
7  4  6  3  5
8  6  5  0  5
9  6  1  0  3

In [105]:
new_df['species'] = "new-species"

# New Col banaya and usme ye value daaldi

In [106]:
new_df.head()

   0  1  2  3      species
0  1  6  1  2  new-species
1  2  1  2  5  new-species
2  4  3  1  0  new-species
3  2  0  2  5  new-species
4  5  0  6  5  new-species

In [107]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [108]:
new_df.columns = iris.columns

# new_df k col names ko iris vaale col names se replace krdiya taaki ye concatenate ho sake same col name k under. Pahle new_df k col names numeric values thee.

In [109]:
new_df.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0             1            6             1            2  new-species
1             2            1             2            5  new-species
2             4            3             1            0  new-species
3             2            0             2            5  new-species
4             5            0             6            5  new-species

In [110]:
iris = pd.concat((iris, new_df), axis=0 )
iris

    sepal_length  sepal_width  petal_length  petal_width      species
0            5.8          3.5           1.4          0.2       setosa
1            4.9          3.0           1.4          0.2       setosa
2            4.7          3.2           1.3          0.2       setosa
3            4.6          3.1           1.5          0.2       setosa
4            5.0          3.6           1.4          0.2       setosa
..           ...          ...           ...          ...          ...
5            4.0          4.0           0.0          1.0  new-species
6            6.0          2.0           3.0          0.0  new-species
7            4.0          6.0           3.0          5.0  new-species
8            6.0          5.0           0.0          5.0  new-species
9            6.0          1.0           0.0          3.0  new-species

[160 rows x 5 columns]

In [111]:
iris.shape

(160, 5)

### Merging Dataframes

In [112]:
df1 = pd.DataFrame({'S_Name' : ['Anurag', 'Shreya', 'Vishu', 'Uday'],
                    'CGPA' :  [ 2 , 4, 5, 3]})

In [113]:
df1

   S_Name  CGPA
0  Anurag     2
1  Shreya     4
2   Vishu     5
3    Uday     3

In [114]:
df2 = pd.DataFrame({'T_Name' : ['Anurag', 'Shreya', 'Vishu', 'Uday'],
                    'CGPA' :  [ 3 , 6, 8, 9]})

In [115]:
df2

   T_Name  CGPA
0  Anurag     3
1  Shreya     6
2   Vishu     8
3    Uday     9

In [116]:
df1.merge(df2, how = 'inner')

# Merging works similar to Joins in SQL

  S_Name  CGPA  T_Name
0   Uday     3  Anurag

In [117]:
df1.merge(df2, how = 'left')

   S_Name  CGPA  T_Name
0  Anurag     2     NaN
1  Shreya     4     NaN
2   Vishu     5     NaN
3    Uday     3  Anurag

In [118]:
df1.merge(df2, how= 'right')

  S_Name  CGPA  T_Name
0   Uday     3  Anurag
1    NaN     6  Shreya
2    NaN     8   Vishu
3    NaN     9    Uday

In [119]:
df1.merge(df2, how= 'outer')

   S_Name  CGPA  T_Name
0  Anurag     2     NaN
1  Shreya     4     NaN
2   Vishu     5     NaN
3    Uday     3  Anurag
4     NaN     6  Shreya
5     NaN     8   Vishu
6     NaN     9    Uday

### Output Files

In [120]:
iris

    sepal_length  sepal_width  petal_length  petal_width      species
0            5.8          3.5           1.4          0.2       setosa
1            4.9          3.0           1.4          0.2       setosa
2            4.7          3.2           1.3          0.2       setosa
3            4.6          3.1           1.5          0.2       setosa
4            5.0          3.6           1.4          0.2       setosa
..           ...          ...           ...          ...          ...
5            4.0          4.0           0.0          1.0  new-species
6            6.0          2.0           3.0          0.0  new-species
7            4.0          6.0           3.0          5.0  new-species
8            6.0          5.0           0.0          5.0  new-species
9            6.0          1.0           0.0          3.0  new-species

[160 rows x 5 columns]

In [121]:
iris.isna().sum()

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

In [122]:
iris.to_csv('./modified_iris.csv', index=False)

# To import in CSV File

In [123]:
modified_iris = pd.read_csv('./modified_iris.csv')

In [124]:
modified_iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.8          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [125]:
iris.to_excel("./new_iris.xlsx", sheet_name="iris sheet")